*** The Array Type

    Arrays:
    Unlike a tuple, every element of an array must have the same type.
    Arrays in rust differ from arrays in some other languages because they have a fixed length, like tuples.
    Arrays are useful when we want our data allocated on the stack rather than on the heap, or when we want to ensure we always have a fixed number of elements.

    Vectors:
    A vector is a similar collection type provided by the standard library that is allowed to grow or shrink in size. If we are unsure whether to use an array or vector, we should probably use a vector.
    
#+name:
#+BEGIN_SRC rust
fn main() {
    // define an array
    let _a = [1, 2, 3, 4, 5];
    let _a: [i32; 5] = [1, 2, 3, 4, 5]; // explicit type declaration and length.
    let a = [3; 5]; // returns an array with 5 elements, all of which are 3.
                    // example of good vector use. no adding / deletion
    let months = [
        "Jan", "Feb", "Mar", "Apr", "May", "Jun", "Jul", "Aug", "Sep", "Oct", "Nov", "Dec",
    ];

    // accessing array elements
    let first = a[0];
    let second = a[1];

    for i in 0..a.len() {
        println!("Month:\t{}\nA:\t{}", months[i], a[i]);
        println!("First:\t{}\nSecond:\t{}", first * i, second * i);
    }
}
#+END_SRC

#+RESULTS: 
#+begin_example
Month:	Jan
A:	3
First:	0
Second:	0
Month:	Feb
A:	3
First:	3
Second:	3
Month:	Mar
A:	3
First:	6
Second:	6
Month:	Apr
A:	3
First:	9
Second:	9
Month:	May
A:	3
First:	12
Second:	12
#+end_example

